loadtest/stress.yml
config:
  target: "{{ $env.TARGET_API }}"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 30
  phases:
    - duration: 60
      arrivalRate: 5
      name: warmup
    - duration: 300
      arrivalRate: 20
      rampTo: 80
      name: steep-ramp
    - duration: 600
      arrivalRate: 80
      name: sustained-peak
  plugins:
    metrics-by-endpoint: {}
  processor: "./processors.js"
  defaults:
    headers:
      Content-Type: application/json

scenarios:
  - name: heavy-browse
    flow:
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ $env.USERNAME }}"
            password: "{{ $env.PASSWORD }}"
          expect:
            - statusCode: 200
      - loop:
          - get:
              url: "/api/events?page={{ $randomNumber(0,10) }}&size=10"
              expect:
                - statusCode: 200
          - think: 0.5
        count: 5